app/Http/Controllers/AgencyController.php

select * from `agencies` where `user_id` = 1631
select * from `area_one`
select * from `area_two`
---
    public function index(Request $request)
    {


        if (!$request->keyword) {
            if (auth()->user()->role->name == 'Agents' || auth()->user()->role->name == 'Agency'){

                $agencies = Agency::where('user_id',auth()->user()->id)->get();
                $area_one = AreaOne::all();
                $area_two = AreaTwo::all();

select * from `area_one`
select * from `area_two`
---
            ));
        }
        }
        $area_one = AreaOne::all();
        $area_two = AreaTwo::all();

select * from `agents` where `agency_id` = 86
---
    public function show(Agency $agency)
    {
        $agents = Agent::where('agency_id', $agency->id)->get();