app/Http/Controllers/HomeController.php

select count(*) as aggregate from `users` where `role_id` = 4
select * from `properties` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `properties`
select * from `projects`
select * from `leads` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `leads`
---
    public function index()
    {
        $today_properties = Property::whereDate('created_at', Carbon::today())->count();
        $today_agencies = Agency::whereDate('created_at', Carbon::today())->count();
        $agency=Agency::count();
        $agent=Agent::count();
        $general_members=User::where('role_id',4)->count();
        $properties=Property::orderBy('created_at','DESC')->paginate(10);
        $projects=Project::all();
        $areas=AreaOne::paginate(10);
        $leads = Lead::orderBy('created_at','DESC')->paginate(5);